In [1]:
# import dependencies
import os
import pandas as pd
import sqlalchemy
from password import password
from sqlalchemy import create_engine, inspect
from sqlalchemy_utils import database_exists, create_database

In [2]:
# create engine and database
engine = create_engine('postgresql://postgres:'+password+'@localhost/country_happyCOL')
if not database_exists(engine.url):
    create_database(engine.url)

In [3]:
# set csv import path
countrypath=os.path.join('02_transform_happiness/temp_country.csv')
happypath=os.path.join('02_transform_happiness','happy_data.csv')
#colpath=os.path.join('02_transform_col','col_data.csv')

In [4]:
# import country data
countrydata=pd.read_csv(countrypath)
countrydata.head()

  countrycode         country
0         AFG     Afghanistan
1         ALB         Albania
2         ATA     Antarctica
3         DZA         Algeria
4         ASM  American Samoa

In [13]:
# create year table
yeardata=pd.DataFrame({"year":["2015","2016","2017","2018","2019"]})
yeardata

   year
0  2015
1  2016
2  2017
3  2018
4  2019

In [5]:
# import happiness data
happydata=pd.read_csv(happypath)
happydata.head()

,year,countrycode,happyrank,happyscore,economy,social,health,freedom,generosity,trust
0,2015,CHE,1,7.587,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678
1,2015,ISL,2,7.561,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630
2,2015,DNK,3,7.527,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139
3,2015,NOR,4,7.522,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699
4,2015,CAN,5,7.427,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811

In [ ]:
# import COL data
#coldata=pd.read_csv(colpath)
#coldata.head()

In [16]:
#drop table if exists
engine.execute("DROP TABLE IF EXISTS COL")
engine.execute("DROP TABLE IF EXISTS happiness")
engine.execute("DROP TABLE IF EXISTS country")
engine.execute("DROP TABLE IF EXISTS year")

In [17]:
# create country table & constraints in SQL
engine.execute("CREATE TABLE country (\
                    countrycode CHAR(3) NOT NULL PRIMARY KEY,\
                    country VARCHAR(100) NOT NULL)")

In [18]:
# save country data into SQL database
countrydata.to_sql(name='country', con=engine, if_exists='append', index=False)

In [19]:
# create year table & constraints in SQL
engine.execute("CREATE TABLE year (year INT NOT NULL PRIMARY KEY)")

In [20]:
# save year data into SQL database
yeardata.to_sql(name='year', con=engine, if_exists='append', index=False)

In [21]:
# create happiness table & constraints in SQL
engine.execute("CREATE TABLE happiness (\
                    id SERIAL PRIMARY KEY,\
                    year INT NOT NULL,\
                    countrycode CHAR(3) NOT NULL,\
                    happyrank INT NOT NULL,\
                    happyscore DECIMAL NOT NULL,\
                    economy DECIMAL NOT NULL,\
                    social DECIMAL NOT NULL,\
                    health DECIMAL NOT NULL,\
                    freedom DECIMAL NOT NULL,\
                    generosity DECIMAL NOT NULL,\
                    trust DECIMAL NOT NULL,\
                    FOREIGN KEY (countrycode)\
                    REFERENCES country(countrycode),\
                    FOREIGN KEY (year)\
                    REFERENCES year(year))")

In [22]:
# save happiness data into SQL database
happydata.to_sql(name='happiness', con=engine, if_exists='append', index=False)

In [ ]:
# create COL table & constraints in SQL
#engine.execute("CREATE TABLE happiness (\
#                    id SERIAL PRIMARY KEY,\
#                    year INT NOT NULL,\
#                    countrycode CHAR(3) NOT NULL,\
#                    costofliving DECIMAL NOT NULL,\
#                    rent DECIMAL NOT NULL,\
#                    groceries DECIMAL NOT NULL,\
#                    restaurant DECIMAL NOT NULL,\
#                    localpurchpower DECIMAL NOT NULL,\
#                    FOREIGN KEY (countrycode)\
#                    REFERENCES country(countrycode),\
#                    FOREIGN KEY (year)\
#                    REFERENCES year(year))")

In [23]:
# ensure that tables are in database
inspector = inspect(engine)
print(inspector.get_table_names())

['year', 'country', 'happiness']

In [24]:
# confirm country table exists in sql by querying it
pd.read_sql_query('select * from country', con=engine).head()

  countrycode         country
0         AFG     Afghanistan
1         ALB         Albania
2         ATA     Antarctica
3         DZA         Algeria
4         ASM  American Samoa

In [25]:
# confirm year table exists in sql by querying it
pd.read_sql_query('select * from year', con=engine).head()

   year
0  2015
1  2016
2  2017
3  2018
4  2019

In [26]:
# confirm happiness table exists in sql by querying it
pd.read_sql_query('select * from happiness', con=engine).head()

,id,year,countrycode,happyrank,happyscore,economy,social,health,freedom,generosity,trust
0,1,2015,CHE,1,7.587,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678
1,2,2015,ISL,2,7.561,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630
2,3,2015,DNK,3,7.527,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139
3,4,2015,NOR,4,7.522,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699
4,5,2015,CAN,5,7.427,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811

In [ ]:
# confirm happiness table exists in sql by querying it
#pd.read_sql_query('select * from col', con=engine).head()